In [17]:
import pandas as pd

In [18]:
df=pd.read_csv("C:/Users/Maanz-AI/Desktop/pandas_tutorial/datas/B17.csv")

In [19]:
df.head()

,Location,Price,Area,Bedrooms,Baths,Link
0,"MPCHS - Block C1, MPCHS - Multi Gardens",2.5 Crore,7 Marla,4,6,https://www.zameen.com//Property/mpchs_multi_g...
1,"MPCHS - Block B, MPCHS - Multi Gardens",3.8 Crore,12 Marla,4,4,https://www.zameen.com//Property/mpchs_multi_g...
2,"MPCHS - Block F, MPCHS - Multi Gardens",1.95 Crore,7 Marla,4,6,https://www.zameen.com//Property/mpchs_multi_g...
3,"MPCHS - Block C1, MPCHS - Multi Gardens",1.75 Crore,5 Marla,3,4,https://www.zameen.com//Property/mpchs_multi_g...
4,"Faisal Margalla City, B-17",2 Crore,7 Marla,6,6,https://www.zameen.com//Property/b_17_faisal_m...

In [36]:
# droping column
df.drop('Link', axis=1).head()

,Location,Price,Area,Bedrooms,Baths
0,"MPCHS - Block C1, MPCHS - Multi Gardens",2.5 Crore,7 Marla,4,6
1,"MPCHS - Block B, MPCHS - Multi Gardens",3.8 Crore,12 Marla,4,4
2,"MPCHS - Block F, MPCHS - Multi Gardens",1.95 Crore,7 Marla,4,6
3,"MPCHS - Block C1, MPCHS - Multi Gardens",1.75 Crore,5 Marla,3,4
4,"Faisal Margalla City, B-17",2 Crore,7 Marla,6,6

In [35]:
# droping multiple columns
df.drop(['Link','Baths'], axis=1).head()

                                  Location       Price      Area Bedrooms
0  MPCHS - Block C1, MPCHS - Multi Gardens   2.5 Crore   7 Marla        4
1   MPCHS - Block B, MPCHS - Multi Gardens   3.8 Crore  12 Marla        4
2   MPCHS - Block F, MPCHS - Multi Gardens  1.95 Crore   7 Marla        4
3  MPCHS - Block C1, MPCHS - Multi Gardens  1.75 Crore   5 Marla        3
4               Faisal Margalla City, B-17     2 Crore   7 Marla        6

In [34]:
# droping 0,1,2 rows
df.drop([0,1,2], axis=0).head()

,Location,Price,Area,Bedrooms,Baths,Link
3,"MPCHS - Block C1, MPCHS - Multi Gardens",1.75 Crore,5 Marla,3,4,https://www.zameen.com//Property/mpchs_multi_g...
4,"Faisal Margalla City, B-17",2 Crore,7 Marla,6,6,https://www.zameen.com//Property/b_17_faisal_m...
5,"MPCHS - Block F, MPCHS - Multi Gardens",1.59 Crore,5 Marla,4,4,https://www.zameen.com//Property/mpchs_multi_g...
6,"B-17, Islamabad",3 Crore,10 Marla,4,5,https://www.zameen.com//Property/islamabad_b_1...
7,"MPCHS - Block B Extension 1, MPCHS - Multi Gar...",2.55 Crore,7.8 Marla,6,6,https://www.zameen.com//Property/mpchs_multi_g...

In [46]:
# this actually getting mean of each row
df.mean(axis=1)

C:\Users\Maanz-AI\AppData\Local\Temp\ipykernel_23956\1377734490.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(axis=1)

0      6.0
1      4.0
2      6.0
3      4.0
4      6.0
      ...
170    7.0
171    3.0
172    8.0
173    4.0
174    8.0
Length: 175, dtype: float64

In [55]:
# same like about 
df.mean(axis='columns')

C:\Users\Maanz-AI\AppData\Local\Temp\ipykernel_23956\3735928689.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(axis='columns')

0      6.0
1      4.0
2      6.0
3      4.0
4      6.0
      ...
170    7.0
171    3.0
172    8.0
173    4.0
174    8.0
Length: 175, dtype: float64

In [51]:
# checking shape
df.mean(axis=1).shape

C:\Users\Maanz-AI\AppData\Local\Temp\ipykernel_23956\4089922379.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(axis=1).shape

(175,)

In [52]:
# this actually getting mean of each colum and numaric data type is just Baths
df.mean(axis=0)

C:\Users\Maanz-AI\AppData\Local\Temp\ipykernel_23956\2367276256.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(axis=0)

Baths    4.714286
dtype: float64

In [57]:
# same like about 
df.mean(axis='rows')

C:\Users\Maanz-AI\AppData\Local\Temp\ipykernel_23956\2893120407.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(axis='rows')

Baths    4.714286
dtype: float64

In [53]:
# checking shape
df.mean(axis=0).shape

C:\Users\Maanz-AI\AppData\Local\Temp\ipykernel_23956\3464406509.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(axis=0).shape

(1,)